{
    "slug": "making-smart-subject-choices",
    "title": "Making Smart Subject Choices",
    "content": "<h3>Think About Your Strengths and Interests</h3>\r\n<p>Choose subjects you enjoy and are good at. When you're genuinely interested in a subject, you're more likely to stay motivated and engaged throughout the year. Reflect on which subjects challenged you in a good way during Year 10.</p>\r\n\r\n<h3>Know Where You’re Headed</h3>\r\n<p>If you have a dream career or university course in mind, research the prerequisites early. Some degrees require specific HSC subjects, so make sure your choices align with your future goals.</p>\r\n\r\n<h3>Balance Is Key</h3>\r\n<p>Aim for a balanced mix of subjects — some that challenge you, some that play to your strengths, and maybe one that’s just for fun. This helps maintain motivation and reduces burnout over two years.</p>\r\n\r\n<h3>Don’t Be Influenced by Friends Alone</h3>\r\n<p>It’s natural to want to stay with friends, but choosing subjects based only on who’s in the class can lead to regret later. Pick what’s right for *you*, not just what others are doing.</p>\r\n\r\n<h3>Consider the Workload</h3>\r\n<p>Some subjects naturally carry a heavier workload than others. Talk to current Year 11 or 12 students, or ask your teachers, about how much time and effort each subject typically requires. Make sure your overall load is manageable.</p>\r\n\r\n<h3>Use Your Teachers’ Advice</h3>\r\n<p>Your teachers know your abilities better than anyone. Ask them for honest feedback on whether you're ready for certain subjects, especially extension courses or sciences and maths.</p>\r\n\r\n<h3>Keep Options Open</h3>\r\n<p>If you're unsure about your future path, choose subjects that keep your options open. For example, Maths Advanced opens doors to many university courses, and English is essential for all pathways.</p>\r\n\r\n<h3>Look Beyond the ATAR</h3>\r\n<p>Remember, your happiness and wellbeing matter too. Don’t pick a subject just because it scales well if it doesn't suit your learning style or interests. Enjoyment and effort often lead to better results than pressure and stress.</p>"
}