{
    "slug": "motivation",
    "title": "Staying Motivated",
    "content": "<h3>Set Goals That Matter to You</h3>\r\n<p>Motivation comes easier when you know *why* you’re working hard. Set personal goals that connect to your dreams — whether it’s getting into your dream university, exploring a career, or simply doing your best. Keep those reasons close when things get tough.</p>\r\n\r\n<h3>Celebrate Small Wins</h3>\r\n<p>Every completed task, every good effort in class, and every small improvement counts. Celebrate these wins — with a treat, a break, or just a proud moment to yourself. Over time, they add up to big success.</p>\r\n\r\n<h3>Surround Yourself with Positivity</h3>\r\n<p>Hang out with people who lift you up and encourage your goals. Whether it’s study buddies, teachers, or family, positive support can boost your confidence and keep you going through challenges.</p>\r\n\r\n<h3>Visualise Your Success</h3>\r\n<p>Spend a few minutes each day imagining yourself achieving your goals — acing a test, giving a great presentation, or walking across the stage at graduation. Visualisation can help build confidence and keep your eyes on the prize.</p>\r\n\r\n<h3>Don’t Compare Yourself to Others</h3>\r\n<p>Everyone has their own journey. Focus on your progress, not someone else’s. Comparison can steal your joy and motivation — so instead, cheer others on and be proud of how far you’ve come.</p>\r\n\r\n<h3>Keep a Motivation Journal</h3>\r\n<p>Write down what inspires you — quotes, affirmations, your goals, or even why you chose your subjects. When you're feeling low, reading back can remind you of your purpose and reignite your drive.</p>\r\n\r\n<h3>Rest Doesn’t Mean Slacking Off</h3>\r\n<p>If you're tired, give yourself permission to rest. A burnt-out brain won’t learn well. Come back refreshed and ready to try again. Rest is part of the process — not the enemy of it.</p>\r\n\r\n<h3>Be Kind to Yourself</h3>\r\n<p>You will have off days — and that’s okay. Don’t let one bad day (or week) define your whole year. Speak to yourself like you would to a friend. Self-compassion keeps motivation alive, even when things don’t go perfectly.</p>"
}