{
    "slug": "time-management",
    "title": "Mastering Time Management",
    "content": "<h3>Plan Your Week Ahead</h3>\r\n<p>Use a planner, diary, or digital calendar to schedule your week. Block out study time, assignments, extracurriculars, and even downtime. Having a visual plan helps reduce last-minute stress and keeps you on top of deadlines.</p>\r\n\r\n<h3>Prioritise with the “To-Do List” Method</h3>\r\n<p>Each day, write a short list of 3–5 key tasks you want to complete. Prioritise them by importance and urgency. Ticking off completed items gives a sense of accomplishment and keeps you motivated.</p>\r\n\r\n<h3>Break Big Tasks into Smaller Steps</h3>\r\n<p>Feeling overwhelmed by a big assignment or exam prep? Break it into smaller, manageable steps and tackle one at a time. This makes work feel less daunting and easier to start.</p>\r\n\r\n<h3>Use the Two-Minute Rule</h3>\r\n<p>If a task takes less than two minutes — like replying to an email or filing notes — do it right away. This rule helps clear small tasks quickly so they don’t pile up and distract you from bigger ones.</p>\r\n\r\n<h3>Set Goals That Motivate You</h3>\r\n<p>Create both long-term (term goals) and short-term (weekly goals) to stay focused. Make sure your goals are specific, realistic, and measurable — like \"Finish History essay draft by Friday\" instead of \"Work on essay sometime.\"</p>\r\n\r\n<h3>Avoid Multitasking — Focus on One Thing</h3>\r\n<p>Switching between tasks actually slows you down and lowers the quality of your work. Give your full attention to one subject or task at a time. You’ll finish faster and remember more too.</p>\r\n\r\n<h3>Protect Your Downtime</h3>\r\n<p>Rest is just as important as study. Schedule regular breaks, sleep, and time to relax or spend with friends and family. A well-rested brain performs better and handles stress more easily.</p>\r\n\r\n<h3>Review Your Routine Weekly</h3>\r\n<p>At the end of each week, take 10 minutes to reflect: What worked? What didn’t? Adjust your schedule and habits accordingly. Small changes over time can lead to big improvements in productivity and balance.</p>"
}